[
	{
		"id": "unveiling-redwoodjs-streamlining-web-development-2023",
		"name": "Unveiling RedwoodJS: Streamlining Web Development from Adam Juran - 2023",
		"descriptionShort": "Adam Juran, a software developer since 1998, will tell us about RedwoodJS, a full-stack framework for building and deploying web applications.",
		"content": [
			{
				"type": "section",
				"title": "Introduction",
				"body": [
					"Adam Juran, a software developer since 1998, will tell us about RedwoodJS, a full-stack framework for building and deploying web applications. He also created a simple blog demo using mostly his CLI (command line interface). Let's delve into the key takeaways from his talk."
				]
			},
			{
				"type": "section",
				"title": "RedwoodJS: The Basics",
				"body": [
					"RedwoodJS, a dynamic JavaScript framework, revolutionizes web development. Unlike libraries, frameworks like Redwood offer pre-built tools and best practices for rapid application creation. RedwoodJS, a full-stack framework, comes out-of-the-box with React, GraphQL, Prisma, TypeScript, Jest, and Storybook."
				]
			},
			{
				"type": "section",
				"title": "RedwoodJS: Blog Posts Demo",
				"body": [
					"In a captivating demo, Mr. Juran showcased RedwoodJS's prowess by swiftly building a functional blog site. The CLI's efficiency in creating endpoints highlighted the framework's power, providing a seamless experience for developers to focus on business logic. RedwoodJS emerges as a game-changer, simplifying and accelerating web app development.",
					"He showed how powerful the CLI (command line interface) is when creating any app. When the application ran, the homepage of the application was a list of all endpoints that RedwoodJS created in just a few commands. He actually created a working blog web app that allows user to create posts and being able to display these posts."
				]
			},
			{
				"type": "section",
				"title": "General Information about the guest lesson",
				"body": [
					"**Is this an event that comes back weekly/yearly? How long did it last?**",
					"This is not an event that comes back weekly or yearly. This event was at Howest and about 1h long.",
					"**Who is the target audience?**",
					"The target audience is software developers that have a little bit of background in software development. RedwoodJS is a full-stack framework that comes with a lot of technologies out of the box. There is a learning curve, but that doesn't last.",
					"**Who was the speaker? What experience did this person have?**",
					"Adam Juran has been 'building stuff on the web' since 1998. He's a self-taught developer with 25 years of experience as an internet consultant and founded Juranosaurus Techs in 2021.",
					"**Was this technical?**",
					"There was a bit of information about RedwoodJS and it's content, but then Mr. Juran created a simple blog post app and it became a more technical. I liked this part, because it actually shows RedwoodJS in action.",
					"**What did you learn?**",
					"I've learned a lot. I haven't heard of RedwoodJS before this event. RedwoodJS let's you use the CLI a lot and it generates code automatically with just a few commands. ",
					"**Did you ever come into contact with this topic inside the education?**",
					"I haven't heard of RedwoodJS yet, but we've worked with Laravel, a full stack framework, in Howest. The difference here is that RedwoodJS uses new technology, such as React, Prisma, ... Laravel doesn't.",
					"**Would you recommend this to other students?**",
					"I would recommend learning about Flutter to any software developer, but this is not very useful for AI developers."
				]
			},
			{
				"type": "section",
				"title": "Conclusion",
				"body": [
					"In conclusion, RedwoodJS emerges as a powerful framework for web development, streamlining the process and accelerating the creation of dynamic applications. With its CLI and pre-built tools, RedwoodJS offers a seamless experience for developers to focus on business logic, rather than boilerplate code. RedwoodJS is a game-changer, and I look forward to exploring it further."
				]
			}
		],
		"date": "14-11-2023",
		"imageSrc": "/assets/images/events/unveiling-redwoodjs-streamlining-web-development-2023.png",
		"linkTo": "/events/unveiling-redwoodjs-streamlining-web-development-2023"
	},
	{
		"id": "the-hidden-benefits-of-flutter-fré-dumazy-2023",
		"name": "The hidden benefits of Flutter from Fré Dumazy - 2023",
		"descriptionShort": "Fré Dumazy is a software developer since 2012, founder of Skystone Apps and he will tell us about the hidden benefits of Flutter.",
		"content": [
			{
				"type": "section",
				"title": "Introduction",
				"body": [
					"Flutter is an open-source UI software development toolkit by Google, enabling the creation of natively compiled applications for mobile, web, and desktop from a single codebase. Its expressive and flexible framework allows developers to craft visually appealing and high-performance apps with a seamless user experience. The speaker of this event, Fré Dumazy, will tell us more about Flutter and why we should use it."
				]
			},
			{
				"type": "section",
				"title": "Flutter: The Basics",
				"body": [
					"Flutter, Google's open-source UI toolkit, relies on the powerful Dart language as its secret sauce. Dart boasts the ability to compile to native code or JavaScript, offering both Ahead-of-Time (AOT) and Just-in-Time (JIT) compilation. This type-safe language provides developers with a rich array of libraries for crafting seamless applications."
				]
			},
			{
				"type": "section",
				"title": "Flutter has Developers In Mind",
				"body": [
					"Designed with developers in mind, Dart introduces a game-changer—stateful hot-reloading. This means that simple UI changes no longer necessitate restarting the entire application, streamlining the development process and enhancing efficiency. Additionally, Dart's rich set of libraries, including the Material Design library, enables developers to create visually appealing applications with ease."
				]
			},
			{
				"type": "section",
				"title": "Open Source: The Power of Collaboration",
				"body": [
					"In the world of Flutter, the possibilities are vast, and the best part? It's all open source, fostering a collaborative environment for innovation and creativity. Explore the magic of Flutter and Dart, where one language unlocks the door to multi-platform app development."
				]
			},
			{
				"type": "section",
				"title": "General Information about the guest lesson",
				"body": [
					"**Is this an event that comes back weekly/yearly? How long did it last?**",
					"This is not an event that comes back weekly or yearly. This event was at Howest and about 1h long.",
					"**Who is the target audience?**",
					"The target audience is mainly for software engineers, but as a student in the AI major, I found it important to know about Flutter. I'm also interested in Software Development and I would now want to create some Flutter projects.",
					"**Who was the speaker? What experience did this person have?**",
					"Fré Dumazy is an app developer since 2012. He's the founder of Skystone Apps, which is an IT Consulancy agency.",
					"**Was this technical?**",
					"This might be a bit technical in comparison with someone that doesn't know how to code, but this is not that technical to someone that knows the programming jargon. Fré showed some code which became a bit more technical, because I haven't see Flutter code, yet.",
					"**What did you learn?**",
					"I've learned that flutter might actually be a good programming language. Flutter can be used for nearly everything. You don't need to learn Kotlin (Android only), or Swift (iOS) only, you can learn Flutter, because it's multi-platform.",
					"**Did you ever come into contact with this topic inside the education?**",
					"We don't have any app development in the AI group, but I've heard about Flutter when studying software development on my own time.",
					"**Would you recommend this to other students?**",
					"I would recommend learning about Flutter to any software developer, but this is not very useful for AI developers."
				]
			},
			{
				"type": "section",
				"title": "Conclusion",
				"body": [
					"In conclusion, the exploration of Flutter and Dart revealed a dynamic duo for versatile app development. Fré Dumazy's insightful session showcased the power of Flutter's open-source framework and Dart's efficiency. For aspiring developers, it's a gateway to multi-platform mastery, making it a worthwhile addition to any coding repertoire."
				]
			}
		],
		"date": "14-11-2023",
		"imageSrc": "/assets/images/events/the-hidden-benefits-of-flutter-fré-dumazy-2023.png",
		"linkTo": "/events/the-hidden-benefits-of-flutter-fré-dumazy-2023"
	},
	{
		"id": "the-creation-of-this-site",
		"name": "The Creation Of This Site",
		"descriptionShort": "Creating a portfolio website is a journey of self-discovery, a process of weaving together a tapestry of skills and experiences. Let me take you on a tour of my journey, from the initial spark of inspiration to the final product.",
		"content": [
			{
				"type": "section",
				"title": "Crafting My Portfolio Website",
				"body": [
					"In crafting my portfolio website, I embarked on a dynamic journey using Firebase and React, weaving together a tapestry of skills in JavaScript, HTML, and CSS. The canvas of my creation extends beyond mere code, as I sought to streamline and organize vast amounts of information without resorting to a conventional database."
				]
			},
			{
				"type": "section",
				"title": "The Dynamic Duo: Vite and React",
				"body": [
					"To tackle the challenge, I turned to the powerful combo of Vite and React, a contemporary duo that effortlessly brings my vision to life. Vite's versatility shines through, offering support for Vue.js, TypeScript, JavaScript, Preact, Lit, Svelte, Solid.js, Qwik, and more. This flexibility made it the standout choice for crafting my digital playground."
				]
			},
			{
				"type": "section",
				"title": "Using a JSON file as a Database?",
				"body": [
					"One of the pivotal aspects of my portfolio lies in the Projects and Events sections, where a multitude of entries share common data elements. To maintain elegance in design and efficiency in development, I opted for a JSON file. This not only keeps the codebase clean but also facilitates easy updates and additions, ensuring that my portfolio remains a dynamic reflection of my journey."
				]
			},
			{
				"type": "section",
				"title": "Deploying with Firebase",
				"body": [
					"And when it came to sharing my creation with the world, Firebase took the stage. Its free tier, unlike many others, doesn't demand a credit card upfront, offering a genuinely free experience. This resonated with my ethos, avoiding the potential pitfalls of unexpected charges for breaching usage limits."
				]
			},
			{
				"type": "section",
				"title": "Conclusion",
				"body": [
					"I had a blast crafting my portfolio website, and I hope you enjoy exploring it as much as I enjoyed creating it! This is still a work in progress, and I look forward to adding more content and features in the future."
				]
			}
		],
		"date": "09-11-2023",
		"imageSrc": "/assets/images/events/the-creation-of-this-site.png",
		"linkTo": "/events/the-creation-of-this-site"
	},
	{
		"id": "improving-user-experience-hendrik-manhaeve-2023",
		"name": "Improving User Experience: Insights from ISO Consultant Hendrik Manhaeve - 2023",
		"descriptionShort": "Explore the latest in UX and UI design with Hendrik Manhaeve, a consultant at the International Standardization Organization (ISO) and a board member of the ISA Belgian chapter.",
		"content": [
			{
				"type": "section",
				"title": "Introduction",
				"body": [
					"In a recent guest lecture, Hendrik Manhaeve, a consultant at the International Standardization Organization (ISO) and a board member of the ISA Belgian chapter, shared valuable insights on User Experience (UX) with a focus on applications, websites, and mobile apps. Let's delve into the key takeaways from his talk."
				]
			},
			{
				"type": "section",
				"title": "Aesthetics",
				"body": [
					"Manhaeve emphasized that aesthetics play a crucial role in creating an emotional connection with users. Pleasing colors, adherence to the golden ratio, and brief visual effects were highlighted as key elements. Transforming traditionally disliked elements, such as forms, into visually appealing components can mitigate user aversion.",
					"He also warned against cluttered interfaces, emphasizing the significance of providing a clear overview for users. Additionally, he advised against underlining text that isn't a hyperlink and highlighted the importance of choosing colors that stand out."
				]
			},
			{
				"type": "section",
				"title": "Usability: Key Principles",
				"body": [
					"Manhaeve, in his discussion on usability, highlighted key principles to enhance the overall user experience.",
					"1. **Controls Selection:** Emphasized long-lasting impact, focusing on effectiveness and efficiency. Advocated for proper control selection, error prevention, and intuitive navigation. Discouraged the use of checkboxes to enforce a choice, recommending radio buttons instead. Stressed the importance of clear and explicit labeling on buttons.",
					"2. **Error Prevention:** Acknowledged user errors as design errors. Urged developers to anticipate potential mistakes and design interfaces to minimize errors. Highlighted the significance of using universally understandable date formats and discouraging multitasking.",
					"3. **Error Messages:** Advocated placing error messages where the error occurred. Emphasized the need for clear information on the problem, its cause, and actionable steps for the user.",
					"4. **Navigation:** Stressed the importance of structured navigation based on user knowledge and de facto standards. Advised against ambiguous terms like \"next\" or \"previous,\" recommending explicit labels. Discouraged the use of fly-out menus and suggested alternatives like the Amazon triangle. Highlighted the crucial role of predictable navigation, referencing a checklist with 247 guidelines.",
					"5. **Visual Hierarchy:** Discussed the visual hierarchy, focusing on call-to-action elements and nudging. Highlighted the effectiveness of colors like orange and blue in emphasizing user benefits.",
					"6. **Fitt's Law:** Introduced Fitt's Law, emphasizing the significance of the \"prime pixel\" and \"magic pixel\" in UI design.",
					"7. **Paradox of Choice:** Noted the negative impact of too many choices, leading to user overwhelm. Suggested solutions such as simplifying options, using subheadings, and grouping related products.",
					"8. **Form Design:** Provided best practices for form design, including asking only necessary questions and using clear labels. Emphasized the importance of avoiding lengthy texts and incorporating inline error detection. Highlighted the need for a clear and user-friendly checkout process.",
					"9. **Product Pages:** Advised presenting product dimensions clearly, considering factors like banner blindness and tunnel vision. Recommended e-commerce platforms offer a guest checkout option to prevent user drop-off during account creation."
				]
			},
			{
				"type": "section",
				"title": "General Information about the guest lesson",
				"body": [
					"**Is this an event that comes back weekly/yearly? How long did it last?**",
					"This is not an event that comes back weekly or yearly. This event was at Howest and about 2h long.",
					"**Who is the target audience?**",
					"The target audience is mainly for software engineers, but as a student in the AI major, I found it important to know as much information about everything as possible. If I know software engineering structures, this will only do me good. This is an introductory level of UX / UI. And the theory behind it was not discussed super much.",
					"**Who was the speaker? What experience did this person have?**",
					"Hendrik Manhaeve is a consultant at the International Standardization Organization (ISO) and a board member of the ISA Belgian chapter. He has a lot of experience in the field of UX / UI. Hendrik Manhaeve is currently a lecturer at Queaso Services. He has been a consultant at the International Standardization Organization (ISO) since 2019.",
					"**Was this technical?**",
					"This guest lecture was not super technical. Nothing of code shown, only practical way. There were given a lot of examples of what to do and what not to do. He also showed websites that were not good and some that were good in their own way.",
					"**What did you learn?**",
					"UX/UI is very interessting, because as said in the guest lecture, it is not only about the looks of the website, but also about the usability of the website. It is important to have a good balance between the two. I learned that it is important to have a good structure in your website, so that the user can easily find what he is looking for. SEO let's the user find its way to the website and UX/UI let's the user stay on the website.",
					"**Did you ever come into contact with this topic inside the education?**",
					"Not really, we had a small introduction to UX/UI in the first year, where we were forced to write clean code and make it look good. But this was not really a big part of the education. It might also be because I'm in an AI major and not in a software engineering major.",
					"**Would you recommend this to other students?**",
					"I would recommend this to other students, because it is important to know the basics of UX/UI. Not every developer needs to know the ins and outs of UX/UI, but it is important to know the basics. This guest lecture was very interesting and I learned a lot from it."
				]
			},
			{
				"type": "section",
				"title": "Conclusion",
				"body": [
					"In conclusion, Hendrik Manhaeve's insights provide a comprehensive guide to enhancing User Experience in digital platforms. By focusing on aesthetics, usability, and thoughtful design choices, developers and designers can create applications, websites, and mobile apps that truly resonate with and serve their users."
				]
			}
		],
		"date": "08-11-2023",
		"imageSrc": "/assets/images/events/improving-user-experience-hendrik-manhaeve-2023.png",
		"linkTo": "/events/improving-user-experience-hendrik-manhaeve-2023"
	}
]
